---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarShapeFailureCustomWarning
source: html/24d1d16d-5f71-8218-7256-8f33153f15fa.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarShapeFailureCustomWarning Property

'[ErrorMessage]'

## Syntax (C#)
```csharp
public static FailureDefinitionId RebarShapeFailureCustomWarning { get; }
```